tutorials/contactAngleTesting/Bretherton/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

// divSchemes
// {
//     div(rhoPhiByEps,U)  Gauss linearUpwind grad(U);
//     div(phi,alpha)   Gauss upwind;
//     div(phirb,alpha) bounded Gauss upwind;
//     div(((rho*nu)*dev2(T(grad(U))))) Gauss linear;
//     div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
// }

divSchemes
{
    //Fluid Schemes
    div(rhoPhiByEps,U)  Gauss linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer01;
    div(phirb,alpha) bounded Gauss upwind;
    div(((rho*nu)*dev2(T(grad(U))))) Gauss linear;

    //Solid Schemes
    div(phisEpss,Us)             Gauss linearUpwind grad(Us);
    div((nu*dev2(T(grad(Us)))))  Gauss linear;
    div(phis,epss)               Gauss vanLeer01;
}


laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected; 
}


// ************************************************************************* //
